#pragma once

#include "enums.h"

/**
 * @brief Структура, представляющая параметр с типом, единицей измерения и значением.
 */
struct Parameter {
    Type type;  ///< Тип параметра (например, давление, влажность, температура).
    Units unit; ///< Единица измерения параметра (например, Кельвин, Паскаль, процент).
    int value;  ///< Значение параметра.

    /**
     * @brief Конструктор для инициализации структуры Parameter.
     * @param t Тип параметра.
     * @param u Единица измерения параметра.
     * @param v Значение параметра.
     */
    Parameter(Type t, Units u, int v)
        : type(t), unit(u), value(v) {}
};
